// Написать программу, которая будет выдавать название дня недели
// по заданному номеру, 3 -> Среда   5 -> Пятница

Console.WriteLine("Введите номер дня недели");
int num1 = int.Parse(Console.ReadLine());
if (num1 == 1)
{
    Console.WriteLine("Понедельник");
}


Console.ReadKey();
