// Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на смо себя) 
//Например, 4-> 16, -3->9, -7 -> 49


int num = int.Parse(Console.ReadLine());
int numResult = num * num;
Console.WriteLine(numResult);