// Напишите программу, которая на вход принимает 2 числа и проверяет, 
//является ли 1е квадратом второго, например, а=25, в =5 -> да



Console.WriteLine("Hello, World!");
